/*
#include "CMICalculate.h"

// =======================================================
// 参数接口实例化
// =======================================================
STime sTime;
SNaviData sNaviData;
SNaviFlag sNaviFlag;
SNaviParam sNaviParam =
{
    6000.0,                 /* 测距信息允许引入最大高度 */
    5.0,                    /* 测距信息允许引入最小高度 */

    6000.0,                 /* 测速信息允许引入最大高度 */
    5.0,                    /* 测速信息允许引入最小高度 */

    6000.0,                 /* 测距数据最大值 */
    2.0,                    /* 测距数据最小值 */

    150.0,                  /* 测速数据最大值 */
    -150.0,                 /* 测速数据最小值 */

    0.1745,                 /* 微波波束重合判断夹角阈值θW, rad */
    0.8,                    /* float64 mdeltat */

    {
        {-0.681998360062498,  0.376675002560280,  0.626892478275403},   /* 微波波束R1本体安装单位矢量u_VBR1 */
        {-0.901277497576550, -0.035972540330746,  0.431747324774487},   /* 微波波束R2本体安装单位矢量u_VBR2 */
        {-0.901277497576550,  0.398098345859369,  0.170931223396453},   /* 微波波束R3本体安装单位矢量u_VBR3 */
        {-1.0,                0.0,                0.0              }    /* 微波波束R4本体安装单位矢量u_VBR4 */
    },

    4,                              /* 导航修正周期 */

    10,                             /* 强制引入测距修正最大次数 */
    10,                             /* 强制引入测速修正最大次数 */
    2000.0,                         /* 强制引入测距修正高度, m */
    2000.0,                         /* 强制引入测速修正高度, m */

    300.0,                          /* 测距估计的垂直速度引入修正高度, m */
    2.0,                            /* 测距估计的垂直速度修正量限幅, m/s */

    0.6428,                         /* 微波波束入射角判断角度余弦, （cos50˚） */
    0.6428,                         /* 动力减速微波入射角判断角度余弦, （cos50˚） */

    0.08727,                        /* 微波波束指向判断夹角阈值, rad, 初值0.08727（5˚） */

    20.0,                           /* 坑外飞跃测距足印距离标称着陆点距离阈值, m */
    100.0,                          /* 弹道飞跃测距足印距离标称着陆点距离阈值, m */
    6000.0,                         /* 弹道飞跃安全模式制导测距足印距离标称着陆点距离阈值, m */

    0.0086,                         /* 测距数据判断加速度阙值1 */
    7.4e-5,                         /* 测距数据判断加速度阙值2 */

    2.4,                            /* 测距数据判断高度阈值1 */
    0.02,                           /* 测距数据判断高度阈值2 */

    100.0,                          /* 测距修正系数1 */
    1000.0,                         /* 测距修正系数2 */

    2.0,                            /* 垂向速度估计系数1 */
    100.0,                          /* 垂向速度估计系数2 */

    0.3,                            /* 测速数据判断高度阈值1 */
    0.02,                           /* 测速数据判断高度阈值2 */
    12.0,                           /* 测速数据判断高度阈值3 */

    0.1,                            /* 测速修正系数1 */
    200.0,                          /* 测速修正系数2 */

    662702469.184,                  /* 星时t的零时刻对应2021-1-1 T 00:00:00（北京时间），相对J2000.0历元时刻的时间差 */

    184723200.0,                    /* 月固系计算参考时刻 */
    {0.18596651, -0.04911382, 0.29026487, 0.93741698},            /* tME时刻月固系相对惯性系姿态四元数 */

    -1.549922188941044,             /* 着陆器的月心纬度 */
    2.153788656838563,              /* 着陆器的月心经度 */
    1739042.0810546875,             /* 着陆器的月心距 */

    -1.549922188941044,             /* 巡视器的月心纬度 */
    2.153788656838563,              /* 巡视器的月心经度 */
    1739042.0810546875,             /* 巡视器的月心距 */

    4.90279980693169e12,            /* 月球引力常数 */

    2.6617e-6,                      /* 月球自转角速度大小, rad/s */

    0.0,                            /* 坑外飞跃滚动调姿角度 */

    24                              /* 重要数据恢复时允许的导航最大迭代次数 */
};

// =======================================================
// Main 函数 (Demo)
// =======================================================
int main(int argc, char *argv[]) {

	// IP调用实例
	// 参数列表： 结构体/数组->传引用(&), 指针/基本类型->传值, 有初值变量->不传
	CMICalculate(&sTime, &sNaviData, &sNaviFlag);

	return 0;
}
*/