/*
#include "AttiErrCalc.h"

// =======================================================
// 参数接口实例化
// =======================================================
SAttiCtrl sAttiCtrl;
SAttiCtrlParam sAttiCtrlParam =
{
    0.08726,    /* 角度控制阈值θM, rad, 对应5° */
    -0.1047,    /* 角速度控制区标称角速度dθr, rad/s, 对应-6°/s */
    0.04,       /* H1C、H2C为滑行段模式调制参数 */
    0.03,       /* H1C、H2C为滑行段模式调制参数 */
    100.0,      /* 脉冲调宽控制积分项限幅IMJ, Nm */

    /* 各通道脉冲调宽参数 */
    /* 滚动     俯仰    偏航 */
    { 1.2,      1.2,   1.2   },    /* ωCtrl[0~2] */
    { 1.0,      1.0,   1.0   },    /* ξCtrl[0~2] */
    { 0.1,      0.1,   0.1   },    /* kiCtrl[0~2] */
    { 1.0,      1.0,   1.0   },    /* m1Ctrl[0~2] */
    { 1.0,      1.0,   1.0   },    /* m2Ctrl[0~2] */
    { 2.0,      2.0,   2.0   },    /* TmJ[0~2] */
    { 0.015,  0.015,   0.015 },    /* H1J[0~2] */
    { 0.005,  0.005,   0.005 },    /* H2J[0~2] */

    /*  */
    /* 滚动     俯仰    偏航 */
    { 2.4,      2.4,   2.4   },    /* ωCtrl2[0~2] */
    { 1.0,      1.0,   1.0   },    /* ξCtrl2[0~2] */
    { 0.1,      0.1,   0.1   },    /* kiCtrl2[0~2] */
    { 1.0,      1.0,   1.0   },    /* m1Ctrl2[0~2] */
    { 1.0,      1.0,   1.0   },    /* m2Ctrl2[0~2] */

    0.0987,                        /* 姿控相平面加速度参数, 5.65°/s2 */
    0.001745,                      /* 姿控相平面角度参数1, 0.1° */
    0.003491,                      /* 姿控相平面角度参数2, 0.2° */

    0.0,                           /* 积分项初值y */
    0.0                            /* 积分项初值z */
};
SGncCtrlFlag sGncCtrlFlag;
SAttiData sAttiData;

// =======================================================
// Main 函数 (Demo)
// =======================================================
int main(int argc, char *argv[]) {

	// IP调用实例
	// 参数列表： 结构体/数组->传引用(&), 指针/基本类型->传值, 有初值变量->不传
	AttiErrCalc(&sAttiCtrl, &sGncCtrlFlag, &sAttiData);

	return 0;
}
*/