/*
#include "AvoidanceCalc.h"

// =======================================================
// 参数接口实例化
// =======================================================
STime sTime;
SModeProcess sModeProcess;
SModeParam sModeParam =
{
    /* 平移模式转接近模式高度距离阈值, m */
    2.0,

    /* 平移模式转接近模式水平距离阈值, m */
    2.0,

    /* 平移模式转接近模式水平速度阈值, m/s */
    2.0,

    /* 平移模式转接近模式时间阈值2, s */
    150.0,

    /* 平移模式转接近模式时间阈值, s */
    5.0,

    /* 平移模式着陆腿调整时间阈值, s */
    21.0,

    /* 上升调姿模式转滑行模式时间阈值, s */
    50.0,

    /* 滑行模式转动力减速模式时间阈值, s */
    80.0,

    /* 动力减速模式转接近模式时间阈值, s */
    120.0,

    /* 坑外飞跃接近模式转缓速下降模式时间阈值, s */
    20.0,

    /* 进坑飞跃接近模式转缓速下降模式时间阈值, s */
    150.0,

    /* 100m平移最大时间阈值, s */
    60.0,

    /* 50m平移最大时间阈值, s */
    60.0,

    /* 平移前成像判断时间阈值, s */
    10.0,

    /* 动力减速制导终端目标高度, m */
    100.0,

    /* 动力减速制导终端目标垂向速度, m/s */
    0.0,

    /* 动力减速制导终端目标垂向加速度, m/s2 */
    1.0,

    /* 安全制导转换条件高度阈值, m */
    2.0,

    /* 安全制导转换条件速度阈值, m/s */
    2.0,

    /* 缓速下降初始高度, m */
    18.0,

    /* 缓速下降标称速度1, m/s */
    -2.0,

    /* 缓速下降标称速度2, m/s */
    -0.7,

    /* 50m悬停下降终端速度, m/s */
    -2.0,

    /* 坑外飞跃接近下降制导终端目标垂向加速度, m/s2 */
    0.4,

    /* 弹道飞跃接近下降制导终端目标垂向加速度, m/s2 */
    0.3,

    /* 50m悬停下降终端加速度, m/s2 */
    0.2,

    /* 缓速下降模式转无控模式高度阈值, m */
    2.0,

    /* 缓速下降模式最小时间, s */
    8.37,

    /* 缓速下降模式最大时间, s */
    32.72,

    /* 着陆腿足端距离机械系YZ面的距离, m */
    0.6764,

    /* 缓速下降模式下, 清除触地开关锁存状态高度, m */
    6.0,

    /* 起飞准备星敏可用性判断时间阈值, s */
    600.0,

    /* 起飞准备姿态角判断阈值, rad */
    0.08726,

    /* 起飞准备姿态角判断时间阈值, s */
    600.0,

    /* 起飞准备IMU有效性判断时间阈值, s */
    600.0,

    /* 起飞准备星敏残差判断时间阈值tδZ, s */
    60.0,

    /* 起飞准备星敏残差判断角度阈值δZmax0, rad */
    0.008726,

    /* 起飞准备星敏可用性判断计数阈值 */
    5,

    /* 起飞准备姿态角判断计数阈值 */
    5,

    /* 起飞准备星敏残差判断计数阈值δZNumMax */
    400,

    /* 有效陀螺个数阈值 */
    4,

    /* 有效加计个数阈值 */
    4,

    /* 延时关闭285N周期数阈值 */
    10
};
SFtdiCtrl sFtdiCtrl;
SFtdiSafeLandData sFtdiSafeLandData;
SNaviData sNaviData;
SGuideData sGuideData;
SAvoidData sAvoidData;
SAvoidParam sAvoidParam =
{
    16.0,           /* 远距离避障目标安全着陆点可用距离, m */
    8.0,            /* 近距离避障目标安全着陆点可用距离, m */

    100.0,          /* 接近段远距离避障高度上限, m */
    50.0,           /* 接近段远距离避障高度下限, m */

    1.0,            /* LcTDI为成像条件位置偏差阈值，初值1m */
    1.0,            /* dLcTDI为成像条件速度偏差阈值，初值1m/s */
    0.01745,        /* φcTDI为成像条件姿态角偏差阈值，初值0.01745rad（1˚） */
    0.01745,        /* ωTDI为成像条件角速度偏差阈值，初值0.01745rad/s（1˚/s） */

    36.0,           /* 高度100m平移距离, m */
    18.0,           /* 高度50m平移距离, m */

    0.0,            /* 平移方向相对轨道法线的角度阈值 */

    -0.9684,        /* 安全点矢量判断阈值x */
    0.1736,         /* 安全点矢量判断阈值y */

    6.0,            /* 安全点成像时刻判断阈值, s */

    404.0,          /* 进坑100m平移质量判断阈值 */
    397.0,          /* 进坑50m平移质量判断阈值 */

    /* 高动态三维系到本体系的转换矩阵 */
    {
        {  0.003607587737626, 0.000456742697906, -0.999993388326554 },
        { -0.857150036737054, 0.515058882066615, -0.002857013468102 },
        {  0.515054171745442, 0.857154676467671,  0.002249617127389 }
    },

    /* 三维相机在机械系下安装位置ΔrFTDI */
    {0.1300307,  -0.385437,  -0.975637}
};

// =======================================================
// Main 函数 (Demo)
// =======================================================
int main(int argc, char *argv[]) {

	// IP调用实例
	// 参数列表： 结构体/数组->传引用(&), 指针/基本类型->传值, 有初值变量->不传
	AvoidanceCalc(&sTime, &sModeProcess, &sFtdiCtrl, &sFtdiSafeLandData, &sNaviData, &sGuideData, &sAvoidData);

	return 0;
}
*/